In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({
    "col1": [1, 2, 3, 1, 2, 3],
    "col2": ["A", "B", "A", "B", "A", "B"]
})

In [3]:
df

   col1 col2
0     1    A
1     2    B
2     3    A
3     1    B
4     2    A
5     3    B

In [20]:
c = r"(df['col1'] == 1) | (df['col2'] == 'A')"

In [21]:
df[eval(c)]

   col1 col2
0     1    A
2     3    A
3     1    B
4     2    A

In [11]:
df[df['col1'] == 1]

   col1 col2
0     1    A
3     1    B

In [12]:
d = "df['col1'] == 1"

In [13]:
df[eval(d)]

   col1 col2
0     1    A
3     1    B